metadata.event_type = "NETWORK_SMTP"
network.direction = "OUTBOUND"
principal.asset.type = "WORKSTATION"
principal.ip = $ip
principal.hostname = $hostname
match:
  $ip, $hostname
outcome:
  $total_bytes = sum(network.sent_bytes)
  $total_connections = count(metadata.id)
  $dest_email = array_distinct(network.email.to)
  $dest_domain = array_distinct(strings.extract_domain(network.email.to))
  $dest_ip = array_distinct(target.ip)
  $dest_port = array_distinct(target.port)
